postman/getHeldItems.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.pokeapi.com/soap/generation">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getHeldItems>
            <gs:name>rattata</gs:name>
        </gs:getHeldItems>
    </soapenv:Body>
</soapenv:Envelope>